AutomatedServiceValidatorAndAccelerator_V1.0/inputXML/Weather/GetWeatherInformation1.2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetWeatherInformation/>
   </soap:Body>
</soap:Envelope>