AutomatedServiceValidatorAndAccelerator_V1.0/inputXML/Weather/GetCityWeatherByZIP1.2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetCityWeatherByZIP>
         <!--Optional:-->
         <weat:ZIP>${ZIP}</weat:ZIP>
      </weat:GetCityWeatherByZIP>
   </soap:Body>
</soap:Envelope>