AutomatedServiceValidatorAndAccelerator_V1.0/inputXML/Default/GetCityForecastByZIP1.2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetCityForecastByZIP>
         <weat:ZIP>${ZIP}</weat:ZIP>
      </weat:GetCityForecastByZIP>
   </soap:Body>
</soap:Envelope>