soap.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetCityForecastByZIP>
         <!--Optional:-->
         <weat:ZIP>${#Project#ZIPCode}</weat:ZIP>
      </weat:GetCityForecastByZIP>
   </soap:Body>
</soap:Envelope>
